tap "homebrew/autoupdate"
tap "mongodb/brew"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Fast, disk space efficient package manager
brew "pnpm"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Allows connection to a computer remotely
cask "anydesk"
# Anthropic's official Claude AI desktop app
cask "claude"
# Developer platform
cask "dotnet-sdk"
# HTTP and GraphQL Client
cask "insomnia"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Clipboard manager
cask "maccy"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# .NET IDE
cask "rider"
# Rust-based terminal
cask "warp"
mas "1Password for Safari", id: 1569813296
mas "Accelerate", id: 1459809092
mas "AdBlock", id: 1402042596
mas "AusweisApp", id: 948660805
mas "Battery Monitor", id: 836505650
mas "Drafts", id: 1435957248
mas "Eradicator", id: 1671150519
mas "Grammarly for Safari", id: 1462114288
mas "Highlighter", id: 1385628859
mas "Instapaper", id: 288545208
mas "Keyword Search", id: 1558453954
mas "LanguageTool", id: 1534275760
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Word", id: 462054704
mas "Noir", id: 1592917505
mas "PDF Reader Pro", id: 919472673
mas "PubPeer", id: 1489865828
mas "Reolink Client", id: 1086871235
mas "Super Agent", id: 1568262835
mas "Telegram", id: 747648890
mas "Vimlike", id: 1584519802
mas "WhatsApp", id: 310633997
